examples/dfHighSpeedFoam/oneD_singleDropletMotion/d_1000/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0 0 0)
    (6 0 0)
    (6 1 0)
    (0 1 0)
    (0 0 1)
    (6 0 1)
    (6 1 1)
    (0 1 1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (600 1 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    Left
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    Right
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }
    empty
    {
        type empty;
        faces
        (
            (0 1 5 4)
            (5 6 7 4)
            (3 7 6 2)
            (0 3 2 1)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
